_posts/algorithms/2019-02-12-offer.html
---
layout: post
title: 剑指 Offer
author: zrg
comments: false
description: 精选谷歌、微软等知名IT企业的典型面试题，从基础知识、代码质量、解题思路、优化效率和综合能力五个方面系统整理了影响面试的5个要点。
categories:
- algorithms
tags:
- 剑指-Offer
photos:
---

<div id="outline-container-org5f7c8ea" class="outline-2">
<h2 id="org5f7c8ea"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>本文内容是《剑指 Offer》的问题求解整理，使其文档化，主要包括问题的代码编写（主流语言）和思路分析。</li>
<li>文章结构按照10小题为一章节来划分，每一小题的编程语言的实现一般按照【低级语言》脚本语言》高级语言】的格式来展示。</li>
<li>引用别人的一句话“我们不生产代码，我们是代码的搬运工”。</li>
<li>文章内容仅供参考。</li>
</ol>
</div>
</div>
<div id="outline-container-org08c02c2" class="outline-2">
<h2 id="org08c02c2"><span class="section-number-2">2</span> 1~10</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>二维数组的查找
<ul class="org-ul">
<li><p>
<b>题目描述</b>
在一个二维数组中（每个一维数组的长度相同），每一行都按照从左到右递增的顺序排序，每一列都按照从上到下递增的顺序排序。请完成一个函数，输入这样的一个二维数组和一个整数，判断数组中是否含有该整数。
</p>
<div class="org-src-container">
<pre class="src src-C++" id="org0002e4e">
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgdecbb34">   &lt;?php

function Find($target, $array)
{
    foreach($array as $key=&gt;$val){
        if(in_array($target,$val)){
            return <span style="color: #ffd866;">"true"</span><span style="color: #727072;">;</span>
        }
    }
    return <span style="color: #ffd866;">"false"</span><span style="color: #727072;">;</span>
}
while(fscanf(STDIN,<span style="color: #ffd866;">"%d,%s"</span>,$a,$b) == 2){
    $target = $a<span style="color: #727072;">;</span>
    eval('$array='.$b.'<span style="color: #727072;">;</span><span style="color: #727072; font-style: italic;">');</span>
    try{
        echo Find($target,$array).<span style="color: #ffd866;">"\n"</span><span style="color: #727072;">;</span>
    }catch(Exception $e){
        die<span style="color: #727072;">;</span>
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-java" id="orge77fbb9">   <span style="color: #ff6188;">public</span> <span style="color: #ff6188;">class</span> <span style="color: #78dce8;">Solution</span> {
    <span style="color: #ff6188;">public</span> <span style="color: #78dce8;">boolean</span> <span style="color: #a9dc76;">Find</span>(<span style="color: #78dce8;">int</span> <span style="color: #fcfcfa;">target</span>, <span style="color: #78dce8;">int</span> [][] <span style="color: #fcfcfa;">array</span>) {
        <span style="color: #78dce8;">int</span> <span style="color: #fcfcfa;">rows</span> = array.length;
        <span style="color: #78dce8;">int</span> <span style="color: #fcfcfa;">cols</span> = array[0].length;
        <span style="color: #78dce8;">int</span> <span style="color: #fcfcfa;">i</span>=rows-1,<span style="color: #fcfcfa;">j</span>=0;
        <span style="color: #ff6188;">while</span>(i&gt;=0 &amp;&amp; j&lt;<span style="color: #78dce8;">cols</span>){
            <span style="color: #ff6188;">if</span>(target&lt;<span style="color: #78dce8;">array</span>[i][j])
                i--;
            <span style="color: #ff6188;">else</span> <span style="color: #ff6188;">if</span>(target&gt;array[i][j])
                j++;
            <span style="color: #ff6188;">else</span>
                <span style="color: #ff6188;">return</span> <span style="color: #ab9df2;">true</span>;
        }
        <span style="color: #ff6188;">return</span> <span style="color: #ab9df2;">false</span>;
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python" id="org3b2a4de"><span style="color: #727072;"># </span><span style="color: #727072; font-style: italic;">-*- coding:utf-8 -*-</span>
<span style="color: #ff6188;">class</span> <span style="color: #78dce8;">Solution</span>:
 <span style="color: #727072;"># </span><span style="color: #727072; font-style: italic;">array &#20108;&#32500;&#21015;&#34920;</span>
 <span style="color: #ff6188;">def</span> <span style="color: #a9dc76;">Find</span>(<span style="color: #ff6188;">self</span>, target, array):
     <span style="color: #fcfcfa;">rows</span>=<span style="color: #ab9df2;">len</span>(array)
     <span style="color: #fcfcfa;">cols</span>=<span style="color: #ab9df2;">len</span>(array[0])
     <span style="color: #fcfcfa;">i</span>=rows-1
     <span style="color: #fcfcfa;">j</span>=0
     <span style="color: #ff6188;">while</span> i&gt;=0 <span style="color: #ff6188;">and</span> j&lt;cols:
         <span style="color: #ff6188;">if</span> target&lt;array[i][j]:
             <span style="color: #fcfcfa;">i</span> -= 1
         <span style="color: #ff6188;">elif</span> target&gt;array[i][j]:
             <span style="color: #fcfcfa;">j</span> += 1
         <span style="color: #ff6188;">else</span>:
             <span style="color: #ff6188;">return</span> <span style="color: #ab9df2;">True</span>
     <span style="color: #ff6188;">return</span> <span style="color: #ab9df2;">False</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgfb85e0c">   class Solution
{
    public bool Find(int target, int[][] array)
    {
        int row=0<span style="color: #727072;">;</span>
        int col=array[0].Length-1<span style="color: #727072;">;</span>
        while(row&lt;=array.Length-1&amp;&amp;col&gt;=0){
            if(target==array[row][col])
                return true<span style="color: #727072;">;</span>
            else if(target&gt;array[row][col])
                row++<span style="color: #727072;">;</span>
            else
                col--<span style="color: #727072;">;</span>
        }
        return false<span style="color: #727072;">;</span>

    }
}
</pre>
</div></li>
<li><b>解题思路</b>
矩阵是有序的，从左下角来看，向上数字递减，向右数字递增，因此从左下角开始查找，当要查找数字比左下角数字大时。右移要查找数字比左下角数字小时，上移。</li>
</ul></li>
<li>替换空格
<ul class="org-ul">
<li><p>
<b>题目描述</b>
请实现一个函数，将一个字符串中的每个空格替换成“%20”。例如，当字符串为We Are Happy.则经过替换之后的字符串为We%20Are%20Happy。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org8a2e072">   &lt;?php
// &#30452;&#25509;&#20351;&#29992;&#20989;&#25968;
function replaceSpace($str)
{
    return str_replace(' ','%20',$str)<span style="color: #727072;">;</span>
}
// &#19981;&#20801;&#35768;&#30452;&#25509;&#35843;&#29992;&#20869;&#32622;&#20989;&#25968;
&lt;?php
function replaceSpace($str)
{
    $res = ''<span style="color: #727072;">;</span>
    $strLength = strlen($str)<span style="color: #727072;">;</span>
    for($i=0<span style="color: #727072;">;</span><span style="color: #727072; font-style: italic;">$i&lt;$len;$i++){</span>
        if($str[$i]==' '){
                $res .='%20'<span style="color: #727072;">;</span>
        }else{
                $res .=$str[$i]<span style="color: #727072;">;</span>
        }
    }
    return $res<span style="color: #727072;">;</span>
}
</pre>
</div></li>
<li><b>解题思路</b>
<ul class="org-ul">
<li>问题1：替换字符串，是在原来的字符串上做替换，还是新开辟一个字符串做替换！</li>
<li>问题2：在当前字符串替换，怎么替换才更有效率（不考虑内置的replace方法）。
<ul class="org-ul">
<li>从前往后替换，后面的字符要不断往后移动，要多次移动，所以效率低下</li>
<li>从后往前，先计算需要多少空间，然后从后往前移动，则每个字符只为移动一次，这样效率更高一点。</li>
</ul></li>
</ul></li>
</ul></li>
<li>从尾到头打印链表
<ul class="org-ul">
<li><p>
<b>题目描述</b>
输入一个链表，按链表值从尾到头的顺序返回一个ArrayList。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgf3557d0">     &lt;?php

/*class ListNode{
    var $val<span style="color: #727072;">;</span>
    var $next = NULL<span style="color: #727072;">;</span>
    function __construct($x){
        $this-&gt;val = $x<span style="color: #727072;">;</span>
    }
}*/
function printListFromTailToHead($head)
{
    $arrayList = []<span style="color: #727072;">;</span>
    while($head !== null){
        $arrayList[]=$head-&gt;val<span style="color: #727072;">;</span>
        $head=$head-&gt;next<span style="color: #727072;">;</span>
    }
    return array_reverse($arrayList)<span style="color: #727072;">;</span>
}
</pre>
</div></li>
<li><b>解题思路</b>
有三种思路，
<ul class="org-ul">
<li>第一就是利用栈先入后出的特性完成；</li>
<li>第二就是存下来然后进行数组翻转；</li>
<li>第三是利用递归。</li>
</ul></li>
</ul></li>
<li>重建二叉树
<ul class="org-ul">
<li><p>
<b>题目描述</b>
输入某二叉树的前序遍历和中序遍历的结果，请重建出该二叉树。假设输入的前序遍历和中序遍历的结果中都不含重复的数字。例如输入前序遍历序列{1,2,4,7,3,5,6,8}和中序遍历序列{4,7,2,1,5,3,8,6}，则重建二叉树并返回。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org98b32e8">
</pre>
</div></li>
<li><b>解题思路</b></li>
</ul></li>

<li><b>题目描述</b>
<b>解题思路</b></li>
<li><b>题目描述</b>
<b>解题思路</b></li>
<li><b>题目描述</b>
<b>解题思路</b></li>
<li><b>题目描述</b>
<b>解题思路</b></li>
<li><b>题目描述</b>
<b>解题思路</b></li>
<li></li>
</ol>
</div>
</div>
<div id="outline-container-org29b3a7a" class="outline-2">
<h2 id="org29b3a7a"><span class="section-number-2">3</span> 11~20</h2>
<div class="outline-text-2" id="text-3">
<p>
<b>题目描述</b>
<b>解题思路</b>
</p>

<p>
<b>题目描述</b>
<b>解题思路</b>
</p>

<p>
<b>题目描述</b>
<b>解题思路</b>
</p>

<p>
<b>题目描述</b>
<b>解题思路</b>
</p>

<p>
<b>题目描述</b>
<b>解题思路</b>
</p>
</div>
</div>

<div id="outline-container-org54730dd" class="outline-2">
<h2 id="org54730dd"><span class="section-number-2">4</span> 21~30</h2>
<div class="outline-text-2" id="text-4">
<p>
<b>题目描述</b>
<b>解题思路</b>
</p>

<p>
<b>题目描述</b>
<b>解题思路</b>
</p>

<p>
<b>题目描述</b>
<b>解题思路</b>
</p>

<p>
<b>题目描述</b>
<b>解题思路</b>
</p>

<p>
<b>题目描述</b>
<b>解题思路</b>
</p>

<p>
<b>题目描述</b>
<b>解题思路</b>
</p>

<p>
<b>题目描述</b>
<b>解题思路</b>
</p>

<p>
<b>题目描述</b>
<b>解题思路</b>
</p>

<p>
<b>题目描述</b>
<b>解题思路</b>
</p>

<p>
<b>题目描述</b>
<b>解题思路</b>
</p>
</div>
</div>
